<a href="https://colab.research.google.com/github/james-monahan/Code-school-notebooks/blob/main/Week-6-pandas-sql/Pandas_Part_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

# Mission 1

Display the following information for this dataset: http://bit.ly/movieusers
- The last 5 rows
- The first 5 rows
- The type of each column

Note : start coding something by typing `pd.read...` and explore the different options available in `pandas`...

In [2]:
url = 'http://bit.ly/movieusers'
df = pd.read_csv(url, delimiter='|', header=None)
print(df.head())
print()
print(df.tail())
print()
print(df.dtypes)

   0   1  2           3      4
0  1  24  M  technician  85711
1  2  53  F       other  94043
2  3  23  M      writer  32067
3  4  24  M  technician  43537
4  5  33  F       other  15213

       0   1  2              3      4
938  939  26  F        student  33319
939  940  32  M  administrator  02215
940  941  20  M        student  97229
941  942  48  F      librarian  78209
942  943  22  M        student  77841

0     int64
1     int64
2    object
3    object
4    object
dtype: object

# Mission 2

Display the first 10 rows in the following file: http://bit.ly/drinksbycountry

In [3]:
url = 'http://bit.ly/drinksbycountry'
df2 = pd.read_csv(url)
df2.head(10)

             country  ...      continent
0        Afghanistan  ...           Asia
1            Albania  ...         Europe
2            Algeria  ...         Africa
3            Andorra  ...         Europe
4             Angola  ...         Africa
5  Antigua & Barbuda  ...  North America
6          Argentina  ...  South America
7            Armenia  ...         Europe
8          Australia  ...        Oceania
9            Austria  ...         Europe

[10 rows x 6 columns]

Set the "country" column as the index for the dataframe.

In [4]:
df2.set_index('country', drop=True, inplace=True,)
print(df2.head())
df2.index

             beer_servings  ...  continent
country                     ...
Afghanistan              0  ...       Asia
Albania                 89  ...     Europe
Algeria                 25  ...     Africa
Andorra                245  ...     Europe
Angola                 217  ...     Africa

[5 rows x 5 columns]

Index(['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola',
       'Antigua & Barbuda', 'Argentina', 'Armenia', 'Australia', 'Austria',
       ...
       'Tanzania', 'USA', 'Uruguay', 'Uzbekistan', 'Vanuatu', 'Venezuela',
       'Vietnam', 'Yemen', 'Zambia', 'Zimbabwe'],
      dtype='object', name='country', length=193)

# Mission 3

Access the values of the row for **Zimbabwe** (use the index value)

In [7]:
df2.iloc[-1]
df2.loc['Zimbabwe']

beer_servings                       64
spirit_servings                     18
wine_servings                        4
total_litres_of_pure_alcohol       4.7
continent                       Africa
Name: Zimbabwe, dtype: object

# Mision 4

Display only the "continent" column value for the country **Zimbabwe**.

In [ ]:
df2.loc['Zimbabwe', 'continent']

'Africa'

# Mission 5

Rename the columns of this dataset: http://bit.ly/uforeports, try using the following 2 different methods to achieve this:
- Setting column names directly when reading the file
- Editing after creating the dataframe

In [ ]:
cols = ['XCity',	'XColors', 'XShape',	'XState',	'XTime']
cols2 = ['ZCity',	'ZColors', 'ZShape',	'ZState',	'ZTime']

url = 'http://bit.ly/uforeports'
df3 = pd.read_csv(url)
df4 = pd.read_csv(url, names=cols2, skiprows=1)

print(df3.head(2))
print()
df3.columns = cols
print(df3.head(2))
print()
print(df4.head(2))

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00

         XCity XColors    XShape XState            XTime
0       Ithaca     NaN  TRIANGLE     NY   6/1/1930 22:00
1  Willingboro     NaN     OTHER     NJ  6/30/1930 20:00

         ZCity ZColors    ZShape ZState            ZTime
0       Ithaca     NaN  TRIANGLE     NY   6/1/1930 22:00
1  Willingboro     NaN     OTHER     NJ  6/30/1930 20:00

# Mission 6

Select the first 3 rows and all the columns of the dataframe using iloc

In [ ]:
#exclusive
df3.iloc[0:3, :]

         XCity XColors    XShape XState            XTime
0       Ithaca     NaN  TRIANGLE     NY   6/1/1930 22:00
1  Willingboro     NaN     OTHER     NJ  6/30/1930 20:00
2      Holyoke     NaN      OVAL     CO  2/15/1931 14:00

# Mission 7

Achieve the same result as in mission 6 by using loc

In [ ]:
#inclusive
df3.loc[:2, :]

         XCity XColors    XShape XState            XTime
0       Ithaca     NaN  TRIANGLE     NY   6/1/1930 22:00
1  Willingboro     NaN     OTHER     NJ  6/30/1930 20:00
2      Holyoke     NaN      OVAL     CO  2/15/1931 14:00